src/Documents/АктПриемкиВыполненныхРаботОказанныхУслуг/АктПриемкиВыполненныхРаботОказанныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемкиВыполненныхРаботОказанныхУслуг</name>
  <basedOn>Document.ДоговорАвторскогоЗаказа</basedOn>
  <basedOn>Document.ДоговорРаботыУслуги</basedOn>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>InformationRegister.ПлановыеНачисленияПоДоговорам</registerRecords>
  <registerRecords>InformationRegister.БухучетДоговоровГПХ</registerRecords>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>DocumentRef.ДоговорАвторскогоЗаказа</types>
      <types>DocumentRef.ДоговорРаботыУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВычета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияЗарплатыВБухучете</name>
    <comment>АПК:58 Способ отражения описывает счет и субконто</comment>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтношениеКЕНВД</name>
    <type>
      <types>EnumRef.ОтношениеКЕНВДЗатратНаЗарплату</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиРуководителя</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаВыплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетовСФизическимиЛицами</name>
    <type>
      <types>EnumRef.СпособыРасчетовСФизическимиЛицами</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.ТерриторииВыполненияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияЗарплатыВФинансовомУчете</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоВСтруктуреПредприятия</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>БухучетУказываетсяРаспределением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиБухучета</name>
    <attributes>
      <name>ПодразделениеУчетаЗатрат</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяФинансирования</name>
      <type>
        <types>CatalogRef.СтатьиФинансированияЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.СтатьиРасходовЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияЗарплатыВБухучете</name>
      <comment>АПК:58 Способ отражения описывает счет и субконто</comment>
      <type>
        <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляРаспределения</name>
      <type>
        <types>DefinedType.ЗначениеДоляРаспределенияБухучетЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ПлановыеНачисленияПоДоговорам/ПлановыеНачисленияПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеНачисленияПоДоговорам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьКодДохода</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>КодВычета</name>
    <type>
      <types>CatalogRef.ВидыВычетовНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьКодВычета</name>
    <type>
      <types>CatalogRef.УдалитьВидыВычетовНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>КодДоходаСтраховыеВзносы</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьКодДоходаСтраховыеВзносы</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовПоСтраховымВзносам</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСпособОтраженияЗарплатыВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОтношениеКЕНВД</name>
    <type>
      <types>EnumRef.ОтношениеКЕНВДЗатратНаЗарплату</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВычета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСуммаЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаключенСоСтудентомРаботающимВСтудотряде</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаВыплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Территория</name>
    <type>
      <types>CatalogRef.ТерриторииВыполненияРабот</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДохода</name>
    <comment>АПК:58 имя ВидДохода уже занято</comment>
    <type>
      <types>EnumRef.КатегорииДоходовНДФЛ</types>
    </type>
  </resources>
  <attributes>
    <name>Договор</name>
    <type>
      <types>DocumentRef.ДоговорАвторскогоЗаказа</types>
      <types>DocumentRef.ДоговорРаботыУслуги</types>
    </type>
  </attributes>
  <dimensions>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорАкт</name>
    <type>
      <types>DefinedType.ДоговорАктЗарплатаКадры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыОсобыхНачисленийИУдержаний/ВидыОсобыхНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОсобыхНачисленийИУдержаний</name>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ДоговорАвторскогоЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ДоговорРаботыУслуги</name>
  </enumValues>
  <enumValues>
    <name>ДСВРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаЗадержкуЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяВыгодаПоЗаймам</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>НачисленоПроцентовПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛЗачтено</name>
  </enumValues>
  <enumValues>
    <name>НДФЛКЗачету</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышения</name>
  </enumValues>
  <enumValues>
    <name>НДФЛРасчетыСБывшимиСотрудниками</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаИзЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьПодарковПризов</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребение</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребениеСотруднику</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышенияПоСтавке18</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышенияПоСтавке20</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышенияПоСтавке22</name>
  </enumValues>
</mdclass:Enum>

src/Enums/КатегорииДоходовНДФЛ/КатегорииДоходовНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДоходовНДФЛ</name>
  <comment>АПК:413 допустима история выбора при вводе, т.к. ОбработкаПолученияДанныхВыбора зависит только от ФО</comment>
  <enumValues>
    <name>ОплатаТруда</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаТрудаАУСН</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ДовольствиеСВОвДенежнойФорме</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>РайонныеСеверныеНадбавки</name>
  </enumValues>
  <enumValues>
    <name>РайонныеСеверныеНадбавкиАУСН</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ДоходВНатуральнойФормеОтТрудовойДеятельности</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ДовольствиеСВОвНатуральнойФорме</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеНатуральныеДоходы</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ДивидендыПоСтавке05</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыПоСтавке10</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыПоСтавке12</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПоСтавке03</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПроцентыПоСтавке05</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПоСтавке06</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПроцентыПоСтавке07</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПроцентыПоСтавке10</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПроцентыПоСтавке15</name>
  </enumValues>
  <enumValues>
    <name>ДоходыПредыдущихРедакций</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыОтДолевогоУчастия</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыПоВыигрышам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыЦБ</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыРЕПО</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыЗаймЦБ</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыИИС</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыПоОблигациям</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыАУСН</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыПоСтрахованиюИПенсОбеспечению</name>
    <comment>АПК:58</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыЦФА</name>
    <comment>АПК:58</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/АктПриемкиВыполненныхРаботОказанныхУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОтражениеЗарплатыВБухучетеРасширенный.ОбновитьДанныеБухучетаДокументаПередЗаписью(ЭтотОбъект);
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбъектОснование = ДанныеЗаполнения;
	
	Если ТипЗнч(ОбъектОснование) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ОбъектОснование, , Истина);
		
		ДоговорГПХ = СотрудникиФормыРасширенный.ДоговорГПХНеЗакрытыйАктом(ОбъектОснование);
		Если ЗначениеЗаполнено(ДоговорГПХ) Тогда
			ОбъектОснование = ДоговорГПХ;
		КонецЕсли; 
		
	КонецЕсли;
	
	ЭтоДоговорРаботыУслуги = ТипЗнч(ОбъектОснование) = Тип("ДокументСсылка.ДоговорРаботыУслуги"); 
	Если ТипЗнч(ОбъектОснование) = Тип("ДокументСсылка.ДоговорАвторскогоЗаказа") Или ЭтоДоговорРаботыУслуги Тогда
		
		СвойстваЗаполнения = "Организация, Сотрудник, СтатьяФинансирования, СтатьяРасходов, ОтношениеКЕНВД,
			|Подразделение, Территория, СпособОтраженияЗарплатыВБухучете,СпособРасчетовСФизическимиЛицами, СуммаВычета, СуммаЕНВД";
		
		Если ЭтоДоговорРаботыУслуги Тогда
			СвойстваЗаполнения = СвойстваЗаполнения + ",
			|СпособОтраженияЗарплатыВФинансовомУчете, МестоВСтруктуреПредприятия";
		КонецЕсли;
		
		ИменаРеквизитов = "Ссылка, Сумма, Проведен, СпособОплаты, " + СвойстваЗаполнения;
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектОснование, ИменаРеквизитов);
		
		Если Не РеквизитыОснования.СпособОплаты = Перечисления.СпособыОплатыПоДоговоруГПХ.ПоАктамВыполненныхРабот Тогда
			ВызватьИсключение НСтр("ru = 'По этому договору не предусмотрена оплата на основании акта выполненных работ.';
									|en = 'Payment based on the acceptance note is not available under this contract.'");
		КонецЕсли;
		
		Если Не РеквизитыОснования.Проведен Тогда
			ВызватьИсключение НСтр("ru = 'Ввод на основании непроведенного документа невозможен.';
									|en = 'You cannot use the ""input on basis"" method for unposted document.'");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОснования, СвойстваЗаполнения); 
		Договор = ОбъектОснование;
		Результат = РеквизитыОснования.Сумма;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	ЕстьФинансовыйУчет = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет");
	Если ЕстьФинансовыйУчет Тогда
		МодульФинансовыйУчет = ОбщегоНазначения.ОбщийМодуль("ФинансовыйУчет");
	КонецЕсли;
	
	Для Каждого Строка Из ДанныеДляПроведения.ДанныеДоговора Цикл
		
		Если Не Строка.ОплатаПоАктам Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В документе %1 должен быть указан вариант оплаты ""по актам выполненных работ"".';
																						|en = 'Payment option ""by receiving notes"" should be specified in document %1.'"), Строка.Договор);
			ВызватьИсключение ТекстОшибки;
			
		ИначеЕсли Не Строка.ДоговорПроведен Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 еще не проведен, акт выполненных работ можно вводить только на основании проведенного документа.';
																						|en = 'Document %1 is not posted yet, you can enter the acceptance note only based on the posted document.  '"), Строка.Договор);
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		НоваяСтрока = Движения.ПлановыеНачисленияПоДоговорам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если ЕстьФинансовыйУчет Тогда
			МодульФинансовыйУчет.СформироватьДвиженияДокументовГПХ(Движения, Строка, НоваяСтрока.Период);
		КонецЕсли;
		
	КонецЦикла;
	
	ОтражениеЗарплатыВБухучете.СформироватьДвиженияБухучетДоговоровГПХ(Движения, ДанныеДляПроведения.НастройкиБухучета);
	
	Движения.ПлановыеНачисленияПоДоговорам.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьДатуВыплаты(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает данные для формирования движений.
// Возвращает таблицу значений - данные, необходимые для формирования плановых начислений по договорам.
//
Функция ДанныеДляПроведения()
	
	НДФЛДоговорыРаботыУслуги = УчетНДФЛ.ДоходыНДФЛПоВидуОсобыхНачислений(Перечисления.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги);
	КодДохода = НДФЛДоговорыРаботыУслуги[0];
	
	ВычетыКДоходам = УчетНДФЛ.ВычетыКДоходам(Год(МесяцНачисления));
	КодВычета = ВычетыКДоходам[КодДохода][0];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КодГПХдляСтраховыхВзносов", УчетСтраховыхВзносов.ВидДоходаДляДоговораНаВыполнениеРабот(Ложь));
	Запрос.УстановитьПараметр("КодГПХдляСтраховыхВзносовОблагаетсяФСС_НС", УчетСтраховыхВзносов.ВидДоходаДляДоговораНаВыполнениеРабот(Истина));
	Запрос.УстановитьПараметр("КодДохода", КодДохода);
	Запрос.УстановитьПараметр("КодВычета", КодВычета);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктВыполненныхРабот.Организация КАК Организация,
	|	АктВыполненныхРабот.МесяцНачисления КАК МесяцНачисления,
	|	АктВыполненныхРабот.Сотрудник КАК Сотрудник,
	|	АктВыполненныхРабот.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ДоговорРаботыУслуги.Номер ЕСТЬ НЕ NULL 
	|			ТОГДА &КодДохода
	|		КОГДА ДоговорАвторскогоЗаказа.Номер ЕСТЬ НЕ NULL 
	|			ТОГДА ДоговорАвторскогоЗаказа.ВидАвторскогоДоговора.КодДоходаНДФЛ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
	|	КОНЕЦ КАК КодДохода,
	|	ВЫБОР
	|		КОГДА ДоговорРаботыУслуги.Номер ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ДоговорРаботыУслуги.ОблагаетсяФСС_НС
	|						ТОГДА &КодГПХдляСтраховыхВзносовОблагаетсяФСС_НС
	|					ИНАЧЕ &КодГПХдляСтраховыхВзносов
	|				КОНЕЦ
	|		КОГДА ДоговорАвторскогоЗаказа.Номер ЕСТЬ НЕ NULL 
	|			ТОГДА ДоговорАвторскогоЗаказа.ВидАвторскогоДоговора.КодДоходаСтраховыеВзносы
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка)
	|	КОНЕЦ КАК КодДоходаСтраховыеВзносы,
	|	ВЫБОР
	|		КОГДА ДоговорРаботыУслуги.Номер ЕСТЬ НЕ NULL 
	|			ТОГДА &КодВычета
	|		КОГДА ДоговорАвторскогоЗаказа.Номер ЕСТЬ НЕ NULL 
	|			ТОГДА ДоговорАвторскогоЗаказа.КодВычета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
	|	КОНЕЦ КАК КодВычета,
	|	АктВыполненныхРабот.Подразделение КАК Подразделение,
	|	АктВыполненныхРабот.Территория КАК Территория,
	|	АктВыполненныхРабот.СпособОтраженияЗарплатыВФинансовомУчете КАК СпособОтраженияЗарплатыВФинансовомУчете,
	|	АктВыполненныхРабот.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	АктВыполненныхРабот.Договор.ДатаНачала КАК ДатаНачала,
	|	АктВыполненныхРабот.Договор.ДатаОкончания КАК ДатаОкончания,
	|	ЕСТЬNULL(АктВыполненныхРабот.Договор.ЗаключенСоСтудентомРаботающимВСтудотряде, ЛОЖЬ) КАК ЗаключенСоСтудентомРаботающимВСтудотряде,
	|	АктВыполненныхРабот.Результат КАК Сумма,
	|	АктВыполненныхРабот.СуммаВычета КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА ДоговорАвторскогоЗаказа.СтавкаНДФЛ ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|		КОГДА ДоговорАвторскогоЗаказа.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка03)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке03)
	|		КОГДА ДоговорАвторскогоЗаказа.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка05)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке05)
	|		КОГДА ДоговорАвторскогоЗаказа.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка06)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке06)
	|		КОГДА ДоговорАвторскогоЗаказа.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка07)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке07)
	|		КОГДА ДоговорАвторскогоЗаказа.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка10)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке10)
	|		КОГДА ДоговорАвторскогоЗаказа.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|	КОНЕЦ КАК КатегорияДохода,
	|	АктВыполненныхРабот.Ссылка КАК ДоговорАкт,
	|	АктВыполненныхРабот.Договор.Проведен КАК ДоговорПроведен,
	|	ВЫБОР
	|		КОГДА АктВыполненныхРабот.Договор.СпособОплаты = ЗНАЧЕНИЕ(Перечисление.СпособыОплатыПоДоговоруГПХ.ПоАктамВыполненныхРабот)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОплатаПоАктам,
	|	АктВыполненныхРабот.ПланируемаяДатаВыплаты КАК ПланируемаяДатаВыплаты,
	|	АктВыполненныхРабот.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	Документ.АктПриемкиВыполненныхРаботОказанныхУслуг КАК АктВыполненныхРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорРаботыУслуги КАК ДоговорРаботыУслуги
	|		ПО АктВыполненныхРабот.Договор = ДоговорРаботыУслуги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорАвторскогоЗаказа КАК ДоговорАвторскогоЗаказа
	|		ПО АктВыполненныхРабот.Договор = ДоговорАвторскогоЗаказа.Ссылка
	|ГДЕ
	|	АктВыполненныхРабот.Ссылка = &Ссылка";
	
	ДанныеДоговора = Запрос.Выполнить().Выгрузить();
	
	РаботаВХозрасчетнойОрганизации = ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации");
	СтатьяРасходовДоговора = Справочники.СтатьиРасходовЗарплата.ПустаяСсылка();
	Если РаботаВХозрасчетнойОрганизации Тогда
		ОписаниеСтатейРасходов = ЗарплатаКадры.СтатьиРасходовПоСпособамРасчетовСФизическимиЛицами();
		СтатьяРасходовДоговора = ОписаниеСтатейРасходов[Перечисления.СпособыРасчетовСФизическимиЛицами.ОплатаТруда];
		РасчетыСКонтрагентами = ОписаниеСтатейРасходов[Перечисления.СпособыРасчетовСФизическимиЛицами.РасчетыСКонтрагентами];
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДоговорРаботыУслуги.Номер ЕСТЬ НЕ NULL 
		|			ТОГДА ДоговорРаботыУслуги.СпособРасчетовСФизическимиЛицами
		|		КОГДА ДоговорАвторскогоЗаказа.Номер ЕСТЬ НЕ NULL 
		|			ТОГДА ДоговорАвторскогоЗаказа.СпособРасчетовСФизическимиЛицами
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыРасчетовСФизическимиЛицами.ПустаяСсылка)
		|	КОНЕЦ КАК СпособРасчетов
		|ИЗ
		|	Документ.АктПриемкиВыполненныхРаботОказанныхУслуг КАК Акт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорРаботыУслуги КАК ДоговорРаботыУслуги
		|		ПО Акт.Договор = ДоговорРаботыУслуги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорАвторскогоЗаказа КАК ДоговорАвторскогоЗаказа
		|		ПО Акт.Договор = ДоговорАвторскогоЗаказа.Ссылка
		|ГДЕ
		|	Акт.Ссылка = &Ссылка";
		СпособыРасчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СпособРасчетов");
		Если ЗначениеЗаполнено(СпособыРасчетов) И ЗначениеЗаполнено(СпособыРасчетов[0]) Тогда
			Если СпособыРасчетов[0] = Перечисления.СпособыРасчетовСФизическимиЛицами.РасчетыСКонтрагентами Тогда
				СтатьяРасходовДоговора = РасчетыСКонтрагентами;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	НовыеНастройкиБухучета = ОтражениеЗарплатыВБухучете.НоваяТаблицаНастройкиБухучетаДоговоровГПХ();
	Если БухучетУказываетсяРаспределением Тогда
		Для каждого СтрокаТЧ Из НастройкиБухучета Цикл
			НоваяСтрока = НовыеНастройкиБухучета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.ДоговорАкт = Ссылка;
			НоваяСтрока.ИдентификаторСтроки = СтрокаТЧ.НомерСтроки;
			Если РаботаВХозрасчетнойОрганизации Тогда
				НоваяСтрока.СтатьяРасходов = СтатьяРасходовДоговора;
			Иначе
				НоваяСтрока.СтатьяРасходов = СтрокаТЧ.СтатьяРасходов;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ИдентификаторСтроки = 0;
		Если СуммаЕНВД > 0 Тогда
			НоваяСтрока = НовыеНастройкиБухучета.Добавить();
			НоваяСтрока.ДоговорАкт 					= Ссылка;
			НоваяСтрока.ИдентификаторСтроки 		= ИдентификаторСтроки;
			НоваяСтрока.ПодразделениеУчетаЗатрат 	= Подразделение;
			НоваяСтрока.СтатьяФинансирования 		= СтатьяФинансирования;
			НоваяСтрока.ОблагаетсяЕНВД 				= Истина;
			НоваяСтрока.ДоляРаспределения 			= СуммаЕНВД;
			НоваяСтрока.СпособОтраженияЗарплатыВБухучете = СпособОтраженияЗарплатыВБухучете;
			Если РаботаВХозрасчетнойОрганизации Тогда
				НоваяСтрока.СтатьяРасходов = СтатьяРасходовДоговора;
			Иначе
				НоваяСтрока.СтатьяРасходов = СтатьяРасходов;
			КонецЕсли;
			ИдентификаторСтроки = ИдентификаторСтроки + 1;
		КонецЕсли;
		Если Результат > СуммаЕНВД Тогда
			НоваяСтрока = НовыеНастройкиБухучета.Добавить();
			НоваяСтрока.ДоговорАкт 					= Ссылка;
			НоваяСтрока.ИдентификаторСтроки 		= ИдентификаторСтроки;
			НоваяСтрока.ПодразделениеУчетаЗатрат 	= Подразделение;
			НоваяСтрока.СтатьяФинансирования 		= СтатьяФинансирования;
			НоваяСтрока.ОблагаетсяЕНВД 				= Ложь;
			НоваяСтрока.СпособОтраженияЗарплатыВБухучете = СпособОтраженияЗарплатыВБухучете;
			Если РаботаВХозрасчетнойОрганизации Тогда
				НоваяСтрока.СтатьяРасходов = СтатьяРасходовДоговора;
			Иначе
				НоваяСтрока.СтатьяРасходов = СтатьяРасходов;
			КонецЕсли;
			Если СуммаЕНВД > 0 Тогда
				НоваяСтрока.ДоляРаспределения = Результат - СуммаЕНВД;
			Иначе
				НоваяСтрока.ДоляРаспределения = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДанныеДоговора", ДанныеДоговора);
	ДанныеДляПроведения.Вставить("НастройкиБухучета", НовыеНастройкиБухучета);
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
